package lesson1_5;

//Создать класс "Сотрудник" с полями: ФИО, должность, телефон, зарплата, возраст;
//Конструктор класса должен заполнять эти поля при создании объекта;
//Написать метод, который выводит информацию об объекте в консоль
// С помощью цикла вывести информацию только о сотрудниках старше 40 лет;

public class Main {
    public static void main(String[] args) {
        Sotrudnik[] person = {
                new Sotrudnik("Иванов", "Директор", 8999001, 10000, 40),
                new Sotrudnik("Александров", "Водитель", 8999002, 20000, 50),
                new Sotrudnik("Алексеев", "Инженер", 8999003, 30000, 30)
        };
//Выводим информацию о всех сотрудниках
        for (int i = 0; i < person.length; i++) {
            person[i].info();

        }
//Выводим информацию о сотрудниках старше 40 лет
        for (int i = 0; i < person.length; i++) {
            person[i].infovozrast();
        }
    }
}
